#### BuiltInFailures.SelectionFailures Members

---

|  |
| --- |
| BuiltInFailures SelectionFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SelectionFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | NoElementSelected | No element selected. |
| Public property Static member | NoValidElementSelected | No valid element selected. |

# See Also

BuiltInFailures SelectionFailures Class

Autodesk.Revit.DB Namespace